[
  {
    "title": "How I became a Product Manager",
    "author": "Unknown",
    "date": "Mar 30, 2018",
    "content": "Mar 30, 2018\n\nA brief* career retrospective\n\nThis post has been in drafts for over a year now. I wrote this as a response to the countless messages I get on Linkedin/Twitter asking how to move to a product role. Over the past 5 years I have worked for various startups, built a few interesting products and switched from a developer to a product manager. This is also my attempt to summarise my career as it stands now and includes learnings from my previous jobs.\n\nI have worked at:\n\nIOCL (Summer Intern, May 2011 — Jul 2011, 3 months)\n\nNGOSphere (Attempt at starting up, Nov 2011 — Jul 2012, 9 months)\n\nRedbus (Summer Intern, May 2012 — Jul 2012, 3 months)\n\nAvaya (Final Semester Intern, Jan 2013 — Jul 2013, 6 months)\n\nKonyLabs (Full time, Aug 2013 — Sept 2013, 2 months)\n\nKore.ai (Full time, Oct 2013 — Nov 2014, 1 year 2 months)\n\nCouponDunia (Full time, Dec 2014 — Dec 2015, 1 year 1 month)\n\nCraftsvilla (Full time, Jan 2016 — Sept 2016, 9 months)\n\nDirecti (Full time, Since Dec 2016, Current)\n\nIOCL and Avaya\n\nIOCL and Avaya were easy. I just had to fill a form and let my college (BITS) and my CGPA (6.0/10) take care of the rest. Thanks to my CGPA I knew I had no chance of getting internships at top tier firms. I tried to learn as much as I could at both places, and got a few good projects under my belt.\n\nLearnings:\n\nThere was no way I could see myself doing a government job. The 3 months at IOCL was enough for me to realise that.\n\nI got interested in management while at IOCL. I took a project related Total Productive Maintenance (TPM)at IOCL and I started a habit of reading as much as I could about best management practices.\n\nAt Avaya, I learnt how big companies run. I was part of sprints, planning meetings for the first time. I also understood how products get built: customer research, prototyping, alpha releases etc.\n\nRedBus\n\nI got into RedBus thanks to something I learnt quite early in my life: there are few people in this world who have the audacity to go after what they really want in life. At BITS, I saw a friend of mine send out close to 200 applications to professors all over the world to land a summer internship abroad. There were people who had much better CGPA. There were people who probably were better at Computer Science than him. But none of them had his drive.\n\nMy only experience till 3rd year of college was a summer internship at IOCL and a failed attempt at starting up. Inspired by my friend, I decided to send out as many applications as possible, no matter how many rejections I got. Thankfully the first email itself worked.\n\n\n\nBy leadership positions I meant a position at the Student Council as an elected representative from my hostel and being a co-founder of NGOSphere (which I will talk about later in this post). I still got an interview. Showing up something is the only thing you need to do, even if you might thing you are not there yet.\n\n\n\nShankar Prasad, the COO, told me that RedBus was exploring expansion in the North East. They had started operations almost a year before, but they had very few tie ups and hence wanted someone to go there. My work was to convince bus operators & travel agencies to partner with RedBus, scale up RedBus’s operations and run a few marketing projects. I don’t know why they felt that I was the guy who could do that, but I was still thankful and jumped at the opportunity.\n\nLearnings:\n\nI realised how much I loved working for a fast paced startup which was in hyper scaling mode. There was no bureaucracy. You did not have to please your manager and could just go out and do your own stuff.\n\nI never felt like a lowly paid intern. I was hustling in the North East, trying to figure out a way to grow RedBus there. I studied the travel industry in and out.\n\nIn the 3 months I was with Redbus I helped double their partners in the North East. Even then I was looking at unique ways I could be valuable for a corporation. Being from the North East helped. I realized that if everything fails in my life, I could still become a city manager for some startup in Guwahati. I got solid recommendations and learnt a lot, something I could never had done at a big corporation.\n\nI Learnt a lot about how culture is important for a startup. At RedBus, Phani (the CEO) used to send Happy Birthday mails to employees. My manager Subhobrata did his best to let me have the freedom to do what I wanted. Even if I was just there just for 3 months, I felt like I was part of the company. People were quick to praise your work and make you feel important.\n\nNGOSphere\n\nThis was our announcement post on Facebook. We were happy to have our own startup. We were vain. And naive. But we tried.\n\nDuring my 2nd year of college I got fascinated with the world of startups. This was the beginning of the startup boom in India. Everywhere I turned, I could see people starting up. Also maybe, I was reading too much TechCrunch.\n\nHere was the idea: There were around 2 million NGOs in India in 2011. Our goal was to get at least 1% of them online. Provide them various services: web site development, brochure design, fund raising, branding. Our goal was to start a web design agency and target only this market.\n\nLearnings:\n\nFinding a datapoint like 2 million NGOs are in India means nothing. We were stupid to assume most of them want to come online and the only thing lacking was a push by us\n\nMost NGOs in India are just tax avoidance scams. They don’t care whether people know about them or not\n\nEven if you manage to convince a few of them to work with you, they will bail at the last minute. The typical excuse would be lack of funds, directors thought otherwise and were no longer interested\n\nMarket validation is really important. We assumed NGOs would use the brand presence to raise more funding. We assumed NGOs would be willing to pay us for digital services. Golden rule of starting up: Never assume. Talk to potential customers. See if they are willing to pay\n\nWe were more interested in getting our visiting cards printed, updating our Linkedin bio. I promised never to do something again in life just because it was the “cool” thing to do. It was a humbling experience, getting rejected by so many people\n\nThankfully something good came out of it: I learnt a lot of lessons which helped me do well in the RedBus internship and later move to a product role. Another co founder started Halaplay and is doing quite well\n\nKonyLabs and Kore.ai\n\nDepending on college placements was the stupidest mistake I made. I was hoping some fast growing startup would come to college and offer me some Business Development or Marketing position. I was not that keen on moving to a developer role. Coding never excited me in college, and I did not know then that something like product management existed. I did not even interview for most of the software companies which came in the beginning of placement season. Only after almost the entire placements were done, I realised what a mistake I had made; with a 6.0 (/10) CGPA I was in deep waters. I had not applied anywhere off campus too. I was running out of options.\n\nSo I did what any sane guy at my situation would do: Read Cormen (textbook on Data Structures) cover to cover and started sitting for interviews.\n\nI still kept getting rejected (messing up in the final rounds of a few companies) and was one of the last guys in my Computer Science batch to get placed. It was a humbling experience. My father would call me every night asking when Microsoft/Google is coming and I had to remind him again and again that with my CGPA I was not even eligible to sit for their interviews.\n\nI finally got placed in a startup called Kony Labs. I joined their team which used Kony Studio (their proprietary platform) to build apps for various companies.The advantage of Kony Studio is that it can generate builds for multiple platforms from a single JS codebase. I wrote about my interview experiences here: Want To Work For An Indian Startup? Here’s What You Need to Do.\n\nI worked at KonyLabs for just 2 months before joining Kore, which spun out from the company. It had the same management team and their goal was to build the next generation workplace collaboration platform. It was the best decision I made. Instead of being one of the 100s of developers I was not part of a small startup where I could learn faster. I would go on to work on the Android app before moving to the Server team.\n\nLearnings:\n\nMost things in life boils down to luck. I could have remained at Kony and kept working on their proprietary platform. It would not have helped me a lot career wise. But due to some random selection I ended up being one of the few freshers moved to Kore.ai\n\nWorking at Kore was fun mostly, but with periods of extreme frustration. I felt we were moving too slow and needed to ship much faster if we wanted to have any chance against Slack. Speed is indeed something which can make or break early startups. There was no north star to speak of.\n\nWorked under an amazing Tech lead. I understood why they say the effective Tech Lead is a 100x engineer. I learnt a lot during my time at Kore. I had no clue about APIs before I joined Kore. I did not know the difference between SOAP and REST properly. One and a half year of writing code helped me learn how to actually roll up my sleeves and build products myself. It also helped me become more emphatic later as a PM, having been a dev myself.\n\nI realised I could never become a good enough dev to work at Google or Amazon. Instead of reading tech blogs I spent far more time reading product development blogs. If I could not finish my work, I would just go home and have a sound sleep, without being up all night figuring out the fix.\n\nCouponDunia\n\nWhile I was at Kore, I received this time capsule I had set in 2012. This capsule was from a mediocre college student who wanted his future self to answer this simple question: “Did you make something good out of your life or are you still getting screwed?”\n\nI realised that even though I could continue at Kore, working as a developer, I did not see myself as a coder 10 years down the line. So I thought “why waste any more time?”\n\nI told my manager that I was quitting and put in my papers. I had a 2 months notice period and in the worst case I was willing to go back to being a dev. Or maybe I could just join a startup as a Product Management intern? I was willing to take the risk. I had been thinking about the switch for a long time and I knew I would just keep thinking about it and not do anything if I was not pushing myself hard enough and showed enough intent. And what is the best way to show intent than quitting your safe job without a new job offer!\n\nThe time capsule which changed my life. Literally.\n\nInstead of writing on how I prepared for Product Management interviews in particular I am linking some really good resources here:\n\nInterviewing for Big Logos with GoogleX former Product Manager.\n\nHow to Prepare for a Product Manager Interview by former Facebook PM.\n\nYou can also go through all the Product School videos. Also read Crack the PM Interview book.\n\nI have also already written on how to look for startup jobs. I followed the exact same approach. Kept pitching to CEOs/Head of Products on how I can add value. Being a generalist really helped to get a foot in the door. But a lack of prior product experience led to a lot of rejections too. Finally I interviewed with 2 startups- CouponDunia and Zoomcar.\n\nI had connected with Sameer, the CEO of CouponDunia on Angellist and I sent my pitch to him.\n\nCouponDunia pitch\n\nThe answer to why I wanted to move to a Product role:\n\nWhy Product manager?\n\nI wrote a long product critique of the app as well as the website. I even found broken links. I had seen how people apply at companies without even using their products. I wanted to show that I cared about the company. I had invested enough time to understand the market as well as the existing products. All I wanted now was a chance.\n\nProduct Critique of the CD app and website\n\nMore ideas to grow the usage\n\nLearnings:\n\nI have already written about my work at CouponDunia. If you are interested you can read this: How We Scaled CashBoss To 500K downloads in 5 months and Farewell CouponDunia…\n\nAbout transitioning to a Product role: 19 lessons I learned during my first year as a Product Manager.\n\nCraftsvilla\n\nI was loving my life at CouponDunia. I had a boss who liked me, who gave me the freedom to do whatever I wanted. But I also realised that I was getting too comfortable in my life/career. I was no longer learning as much. I had scaled CashBoss to 1million installs and profitability but if we were to reach the next level, we would need a far bigger investment in Marketing.\n\nI was also seriously contemplating switching to one of the “Rocket Ships”. People suggest you to jump into one, no matter what role you get. I was helping a few other startups during this time including one which eventually got acquired by Quikr.\n\nIt was during that time Craftsvilla reached out to me. It was supposed to be a random coffee meet with the VP of Product but things turned out for the good and I got a job offer. The following points made the role really exciting:\n\nCraftsvilla was one of the fast growing rocketships you read on various startup blogs. Funded by top investors it had raised a massive round at a valuation of around 200 mil and there were talks about a listing on NASDAQ.\n\nOne of my long term goals then was to move into VC after getting enough startup experience. I thought this would be a good opportunity to work and network with people in the industry. Almost all the VPs at Craftsvilla were ex VCs.\n\nLastly my role: I was being offered the chance to head mobile apps which seemed too good of a role to refuse.\n\nI talked about ways to demonstrate value earlier. Even before I officially joined Craftsvilla, I started working on growth. Thinking about how to make Craftsvilla the next unicorn was all I could think of.\n\nAlways be ready to contribute and demonstrate value as early as possible\n\nLearnings:\n\nLearnt how to make decisions with data. Every feature you pitch at Craftsvilla had to be backed with metrics and every release supposed to improve on Conversion.\n\nGot domain knowledge of the e-commerce industry; from logistics to category management to merchandising.\n\nUnderstood how highly funded VC funded startups work from the inside.\n\nBy the end of 9 months I had a sad realisation: Most of the people I enjoyed working with had left due to various issues. The Indian startup ecosystem was in turmoil. Every day you could see startups shutting down. Raising new rounds was becoming harder by the day. And Indian e-commerce sector is still in its infancy. Customer retention is hard. Every one is just burning money to retain people who wont think twice before shopping at your competitor for a 10% extra discount. Even the market leader Flipkart is still bleeding losses.\n\nDirecti\n\nI spent the next 3 months at home. For a change I did not have to respond to mails asking why conversion dropped by 20% on a Sunday afternoon. I met quite a few startups (based in Guwahati). It was good fun but time was running out. I needed to look for a job again.\n\nI evaluated my options. I did not want to join another e-commerce company unless it was a market leader. Chat platforms were becoming huge. Lot of interesting companies working in the space. I had read like 100 blogposts on Wechat already.\n\nSo I decided to apply to the only two companies in India working on Chat: Hike and Flock. I wrote a 10 pager on how to take Hike to the next level and sent it to their Head of Growth. I also dropped a mail to Bhavin, the CEO of Directi.\n\nFun fact: When I say I hope this somehow lands in your inbox I meant it literally. I normally don’t go through the typical HR route and just reach out to the Hiring manager/Head of Product/ CEO with a value proposition mail. And I sure as hope it lands on their Inbox and not the spam folder.\n\nfirst part of the mail/pitch\n\na bunch of product ideas\n\ninvoking wechat spirit\n\nAlways explain the ‘why’\n\nI managed to get into Directi and join their Apps team. I have been working on exactly the same things I mentioned in the mail. There have been pros as well as cons but there won’t be a retrospective section for Directi for now.\n\nThat’s all folks!\n\nWhy I wrote this?\n\nI know there is no point writing a retrospective for your career when it has not even been 5 years since you passed out of college. This might even look narcissistic somehow. But I did end up doing a lot of things in my life over the last few years which I wanted as a teenager in college. I did not go to any MBA school. I worked at various promising startups and gave my best (till I could, and then moved on). I hope this inspires someone who is still at college and wondering whether they can ever find modest level of professional success.\n\nThis also answers how I got into Product.\n\nThanks for reading.",
    "url": "https://manassaloi.com/2018/03/30/how-i-became-pm.html"
  },
  {
    "title": "",
    "author": "Tim Urban",
    "date": "",
    "content": "PDF: We made a fancy PDF of this post for printing and offline viewing. Buy it here. (Or see a preview.)\n\n___________\n\npro-cras-ti-na-tion |prəˌkrastəˈnāSHən, prō-|\nnoun\nthe action of delaying or postponing something: your first tip is to avoid procrastination.\n\nWho would have thought that after decades of struggle with procrastination, the dictionary, of all places, would hold the solution.\n\nAvoid procrastination. So elegant in its simplicity.\n\nWhile we’re here, let’s make sure obese people avoid overeating, depressed people avoid apathy, and someone please tell beached whales that they should avoid being out of the ocean.\n\nNo, “avoid procrastination” is only good advice for fake procrastinators—those people that are like, “I totally go on Facebook a few times every day at work—I’m such a procrastinator!” The same people that will say to a real procrastinator something like, “Just don’t procrastinate and you’ll be fine.”\n\nThe thing that neither the dictionary nor fake procrastinators understand is that for a real procrastinator, procrastination isn’t optional—it’s something they don’t know how to not do.\n\nIn college, the sudden unbridled personal freedom was a disaster for me—I did nothing, ever, for any reason. The one exception was that I had to hand in papers from time to time. I would do those the night before, until I realized I could just do them through the night, and I did that until I realized I could actually start them in the early morning on the day they were due. This behavior reached caricature levels when I was unable to start writing my 90-page senior thesis until 72 hours before it was due, an experience that ended with me in the campus doctor’s office learning that lack of blood sugar was the reason my hands had gone numb and curled up against my will. (I did get the thesis in—no, it was not good.)\n\nEven this post took much longer than it should have, because I spent a bunch of hours doing things like seeing this picture sitting on my desktop from a previous post, opening it, looking at it for a long time thinking about how easily he could beat me in a fight, then wondering if he could beat a tiger in a fight, then wondering who would win between a lion and a tiger, and then googling that and reading about it for a while (the tiger would win). I have problems.\n\nTo understand why procrastinators procrastinate so much, let’s start by understanding a non-procrastinator’s brain:\n\n\n\nPretty normal, right? Now, let’s look at a procrastinator’s brain:\n\n\n\nNotice anything different?\n\nIt seems the Rational Decision-Maker in the procrastinator’s brain is coexisting with a pet—the Instant Gratification Monkey.\n\nThis would be fine—cute, even—if the Rational Decision-Maker knew the first thing about how to own a monkey. But unfortunately, it wasn’t a part of his training and he’s left completely helpless as the monkey makes it impossible for him to do his job.\n\n\n\n\n\n\n\n\n\nThe fact is, the Instant Gratification Monkey is the last creature who should be in charge of decisions—he thinks only about the present, ignoring lessons from the past and disregarding the future altogether, and he concerns himself entirely with maximizing the ease and pleasure of the current moment. He doesn’t understand the Rational Decision-Maker any better than the Rational Decision-Maker understands him—why would we continue doing this jog, he thinks, when we could stop, which would feel better. Why would we practice that instrument when it’s not fun? Why would we ever use a computer for work when the internet is sitting right there waiting to be played with? He thinks humans are insane.\n\nIn the monkey world, he’s got it all figured out—if you eat when you’re hungry, sleep when you’re tired, and don’t do anything difficult, you’re a pretty successful monkey. The problem for the procrastinator is that he happens to live in the human world, making the Instant Gratification Monkey a highly unqualified navigator. Meanwhile, the Rational Decision-Maker, who was trained to make rational decisions, not to deal with competition over the controls, doesn’t know how to put up an effective fight—he just feels worse and worse about himself the more he fails and the more the suffering procrastinator whose head he’s in berates him.\n\nIt’s a mess. And with the monkey in charge, the procrastinator finds himself spending a lot of time in a place called the Dark Playground.1\n\nThe Dark Playground is a place every procrastinator knows well. It’s a place where leisure activities happen at times when leisure activities are not supposed to be happening. The fun you have in the Dark Playground isn’t actually fun because it’s completely unearned and the air is filled with guilt, anxiety, self-hatred, and dread. Sometimes the Rational Decision-Maker puts his foot down and refuses to let you waste time doing normal leisure things, and since the Instant Gratification Monkey sure as hell isn’t gonna let you work, you find yourself in a bizarre purgatory of weird activities where everyone loses.2\n\n\n\nAnd the poor Rational Decision-Maker just mopes, trying to figure out how he let the human he’s supposed to be in charge of end up here again.\n\n\n\nGiven this predicament, how does the procrastinator ever manage to accomplish anything?\n\nAs it turns out, there’s one thing that scares the shit out of the Instant Gratification Monkey:\n\n\n\nThe Panic Monster is dormant most of the time, but he suddenly wakes up when a deadline gets too close or when there’s danger of public embarrassment, a career disaster, or some other scary consequence.\n\n\n\n\n\n\n\nThe Instant Gratification Monkey, normally unshakable, is terrified of the Panic Monster. How else could you explain the same person who can’t write a paper’s introductory sentence over a two-week span suddenly having the ability to stay up all night, fighting exhaustion, and write eight pages? Why else would an extraordinarily lazy person begin a rigorous workout routine other than a Panic Monster freakout about becoming less attractive?\n\nAnd these are the lucky procrastinators—there are some who don’t even respond to the Panic Monster, and in the most desperate moments they end up running up the tree with the monkey, entering a state of self-annihilating shutdown.\n\nQuite a crowd we are.\n\nOf course, this is no way to live. Even for the procrastinator who does manage to eventually get things done and remain a competent member of society, something has to change. Here are the main reasons why:\n\n1) It’s unpleasant. Far too much of the procrastinator’s precious time is spent toiling in the Dark Playground, time that could have been spent enjoying satisfying, well-earned leisure if things had been done on a more logical schedule. And panic isn’t fun for anyone.\n\n2) The procrastinator ultimately sells himself short. He ends up underachieving and fails to reach his potential, which eats away at him over time and fills him with regret and self-loathing.\n\n3) The Have-To-Dos may happen, but not the Want-To-Dos. Even if the procrastinator is in the type of career where the Panic Monster is regularly present and he’s able to be fulfilled at work, the other things in life that are important to him—getting in shape, cooking elaborate meals, learning to play the guitar, writing a book, reading, or even making a bold career switch—never happen because the Panic Monster doesn’t usually get involved with those things. Undertakings like those expand our experiences, make our lives richer, and bring us a lot of happiness—and for most procrastinators, they get left in the dust.\n\nSo how can a procrastinator improve and become happier? See Part 2, How To Beat Procrastination.\n\n___________\n\n\n\nMy TED Talk on procrastination\n\n_______\n\nIf you like Wait But Why, sign up for our email list and we’ll send you new posts when they come out.\n\nTo support Wait But Why, visit our Patreon page.\n\n___________\n\nTwo related WBW posts:\n\nWhy you shouldn’t care what other people think. A different struggle going on in another part of your brain. Meet the mammoth.\n\nA religion for the nonreligious. An even deeper look at the deal with the monkey and the other animals in your brain.\n\nWhile they’re ruining your life, you might as well cuddle with them:\n\n\n\nA lot of you are probably reading this article while in the Dark Playground.↩\n\nI spent two hours in the Dark Playground right before I drew the Dark Playground drawing, because I was dreading having to draw the signpost, which I knew would be hard and take forever (which it did).↩",
    "url": "https://waitbutwhy.com/2013/10/why-procrastinators-procrastinate.html"
  }
]